fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДогвора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаЕжемесячнойАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасасРаботыСпециалиста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ВКМ_ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
    УправлениеВидимостьюДополнительныхРеквизитов();
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюДополнительныхРеквизитов()

    Если Объект.ВидДоговора = Неопределено Тогда
    	
    Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость               = Ложь;
    Элементы.ВКМ_ДатаОкончанияДействияДогвора.Видимость              = Ложь;
    Элементы.ВКМ_СуммаЕжемесячнойАбонентскойПлаты.Видимость          = Ложь;
    Элементы.ВКМ_СтоимостьЧасасРаботыСпециалиста.Видимость             = Ложь;
    
    ИначеЕсли Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда

    Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость               = Истина;
    Элементы.ВКМ_ДатаОкончанияДействияДогвора.Видимость              = Истина;
    Элементы.ВКМ_СуммаЕжемесячнойАбонентскойПлаты.Видимость          = Истина;
    Элементы.ВКМ_СтоимостьЧасасРаботыСпециалиста.Видимость             = Истина;
    
    Иначе
    Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость               = Ложь;
    Элементы.ВКМ_ДатаОкончанияДействияДогвора.Видимость              = Ложь;
    Элементы.ВКМ_СуммаЕжемесячнойАбонентскойПлаты.Видимость          = Ложь;
    Элементы.ВКМ_СтоимостьЧасасРаботыСпециалиста.Видимость             = Ложь;
    КонецЕсли;

КонецПроцедуры
